# -*- coding: utf-8 -*-
# 多重代入
a = 1
b = 2
c = 3

@a, @b, @c = a,b,c

@a                              # => 1
@b                              # => 2
@c                              # => 3

def hoge()
  return 4,5,6
end

@a, @b, @c = hoge

@a                              # => 4
@b                              # => 5
@c                              # => 6

# 入れ替えもできる
@a, @b = 1, 0

@a, @b = @b, @a
@a                              # => 0
@b                              # => 1

# 配列の要素をとりだす
@a, @b = [1,2]

@a                              # => 1
@b                              # => 2

@a, = [1,2,3,4]

@a                              # => 1

# のこりは配列に
@a, *@b = 1,2,3,4

@a                              # => 1
@b                              # => [2, 3, 4]


# 複雑な配列も簡単に？
@a, @b, @c = [1,[2,3],4]

@a                              # => 1
@b                              # => [2, 3]
@c                              # => 4

@a, (@b,@d), @c = [1,[2,3],4]

@a                              # => 1
@b                              # => 2
@c                              # => 4
@d                              # => 3
